Revit 2024 API
RebarConstrainedHandle.GetHandleType Method
 Returns the RebarHandleType of a RebarConstrainedHandle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public RebarHandleType GetHandleType()
Visual Basic
Public Function GetHandleType As RebarHandleType
Visual C++
public:
RebarHandleType GetHandleType()
Return Value
 The RebarHandleType of the specified RebarConstrainedHandle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  RebarConstrainedHandle is no longer valid.
See Also
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace